start_text = f"""📐 Привет, ученик! Добро пожаловать в бота по событию <b>«Неделя математики»</b> в <i>ГБОУ школе №2122 имени О. А. Юрасова</i>.

🤔 <b>Неделя математики</b> - это неделя, на протяжении которой ученики <i>5-11</i> классов проходят различные викторины и задания в боте, изучают интересные факты о предметах технического направления: <b>математика, физика, информатика</b>.
<blockquote>Для получения подробной информации о заданиях введи /event_calendar</blockquote>

🧩 Данный бот позволит тебе узнать много интересного о таких предметах, а так же проверить знания по ним (не исключено, что учитель может поощрить тебя хорошей оценкой за твои старания). 

🎯 Каждый день <b>Недели математики</b> бот будет открывать по 2 новых задания на каждый предмет и дополнительно присылать интересные факты и викторины к ним.

📅 <b>Неделя математики</b> 2024: <code>04.03.2024 - 13.03.2024</code>
"""

points_system_text = ("ℹ️ <b>Основная информация</b>\n\n<i>Балловая система:</i>\n☆ <u>Базовый уровень сложности</u> - <i>1 балл</i>"
            "\n☆ <u>Средний уровень сложности</u> - <i>2 балла</i>\n☆ <u>Высокий уровень сложности</u> - <i>3 балла</i>"
            "\n★ <u>Углубленный уровень сложности</u> - <i>7 баллов</i>\n\n<code>Максимальное количество баллов для одного предмета: 38</code>\n\n"
                  "")

bot_about_text = ('💻 <b>О проекте</b>\n\n✦ <i><a href="https://github.com/BelGray/mathweek2122_bot">Репозиторий GitHub</a></i>\n\n'
                  '<u>Участники проекта:</u>\n\n<i>Разработчики:</i>\n▹ @bel_gray\n▹ @george_fil'
                  '\n\n<i>Составители заданий:</i>\n ▹ @george_fil\n ▹ @Dmitriev_Timur\n ▹ @mariasmol007'
                  '\n\n<i>Составители викторин:</i>\n ▹ @george_fil\n ▹ @vashtimoshka'
                  '\n\n<i>Составители статей:</i>\n ▹ @george_fil\n ▹ @vashtimoshka'
                  '\n\n<i>Реализация идеи проекта:</i>\n ▹ @bel_gray'
                  '\n\n<i>Идея проекта:</i>\n ▹ <a href="https://web.telegram.org/k/#5255516914">Скобеева Валентина Петровна</a>')

